# Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
# [”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
# Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
# Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
# Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”

mass = ['1,2,3,4', '1,2,3,4,50', 'qwerty1,2,3']
mass_2 = ['1,2,3,4,5,5', '1,2,3,4,50,9,15,22,31', 'qwerty1,2,3']

def mass_sum(data):
      for item in data:
        numbers = item.split(',')

        try:
            total = 0

            for number in numbers:
                number = int(number)
                total = total + number
            print(total)

        except ValueError:
            print('Не можу це зробити')

mass_sum(mass)
mass_sum(mass_2)


